

# # for 문 -> 반복문
# # 갯수 ,범위 를 특정할 수 있을 때 ..

# # while -> 반복문
# # 몇 번할지 모를 때 ..

# # % ?! -> 낯설어..
# # % 나머지연산자 + // 몫연산자
# # -> 배수, 짝홀, 십의자릿수 조건 , 일의자리수 조건..

# # for .. -> 블럭.. such as "if,fun,while"
# # if 중첩.. 기억나니? -> 블럭은 중첩이가능해
# # for 문 중첩 .!

# # for -> 1차원 적이야.

# # -------------------- (선이야.)
# # i = 0 , j 0->9 10번
# # i = 1 , j 0->9 10번


# for i in range(8):

#     for j in range(4):
#         print("*", end=" ")
#     print()

# (0,0) (0,1) (0,2) (0,3) (0,4) (0,5) (0,6) (0,7) (0,8) (0,9)
# (1,0) (1,1) (1,2) (1,3) (1,4) (1,5) (1,6) (1,7) (1,8)
# (2,0) (2,1) (2,2) (2,3) (2,4) (2,5) (2,6) (2,7)
# (3,0) (3,1) (3,2) (3,3) (3,4) (3,5) (3,6)
# 4 5 6 7 8 9
# 5 6 7 8 9
# 6 7 8 9
# 7 8 9
# 8 9
# 9


# * * * * *
# * * * *
# * * *
# * *
# *

# * * * * * * * * * *
# * * * *     * * * *
# * * *         * * *
# * *             * *
# *                 *

# * * * * *  * * * * *
# * * * *      * * * *
# * * *          * * *
# * *              * *
# *                  *

# * *              * *
# * * *          * * *
# * * * *      * * * *
# * * * * *  * * * * *

# 0 % 2 -> 0
# if == 0:
#     continue

# 날짜가 긴날에는 더긴것

# 교실 2
# 복도 3
# 화장실 12

t_cnt, w_cnt, c_cnt = 0, 0, 0
n = int(input())
for i in range(n+1):
    if i == 0:
        continue
    elif i % 12 == 0:
        t_cnt += 1
    elif i % 3 == 0:
        w_cnt += 1
    elif i % 2 == 0:
        c_cnt += 1

print(c_cnt, w_cnt, t_cnt)


# -> 블럭에서
# if i == 0:
# elif i % 12 == 0:
# elif i % 3 == 0:
# elif i % 2 == 0:

# 윤년?
# -> 4배수
#   -> 100 아니라면 윤년
#   -> 100 라면 윤년 아님

# 숙제 (분석하기)
# - a 부터 b 까지
# - 369 게임
# - 완전수 판별기
