# 완전수
# 머리 혹은 말로 , 1차적인 생각.
# 쉬운데 막상 스스로 사고자체로하는게 잘안되거든.
# "안다는 것"과 모르는 것의 차이를 우리쉽게 인지못해
# "안다는 것" <- 의심
# 끊임없이 (정의) 물어라. / 내가 뭘 정리할 건지..?

# <완전수의 정의>
# 약수들의 합이 본인수와 같다면 완전수

# <약수의 정의>
# 약수는 본인을 이루는..
# 본인을 어떤 수로 나누었을 때 나누어 떨어진다면 ,,

# 너의 머리로 되는 것과 되지않는 것을 구분해.


# 배열 ,, (튜플..)

# 어떤 타입으로 일정 데이터들의 집합.

arr = [1, 312, 4, 514122, 3]


# addAB : 함수 ,,(동사를 써라)
#
# print(sum([1, 2]))


# 연산을 포함한,,조건? (조건 내부에서는 초기화 할 필요할가 없어!)

a = int(input())


# a의 3 배한 값이.. 14보다 작다면 -> if
# a의 3 배한 값 => a*3

# if(a*=3)(X)
# a+=1 : a = a + 1

# if (a*3) < 14:

# a 제곱 나누기 3한 값이.. 홀수라면 -> if
# a 의 나머지의 자리수가 2 이상이라면 -> if
