# .확장자
# .py : "파이썬 파일"
# ---------------------------
# print("hello world")
# a = input("\npress key :")
# print(a)

# ---------------------------

# 파이썬으로 뭘할 수 있까?
# 게임 , 웹개발의 백 , 앱 개발 , 통계 , 딥러닝 , **(솔루션)터미널로 출력하기**

# **터미널로 출력하기**
# 한 가지 프로그래밍 언어를 할 줄 알면, 다른 언어도 쉽게 배운다 .
# 안 하면 까먹어 , 언어는 까먹으면 검색하면돼
# 질문은 마음껏해도 돼
# 복습은 해주면 좋아, 15-20 분 복습 / 30분정도 진도 (문제)

# print : 출력이란 뜻

# () 는 버튼 ...
# print 기능을 활성화 시키는 버튼이다.
# print(1)
# 프린트 기능을 담당하는 녀석의 버튼에 값(숫자,문자) 를 넣어

# 함수 : 기능을 담당하는 녀석 / f(x):print(x)
# 매개변수 : 버튼에 넣는 값(숫자,문자) / 정의역,parameter(매개변수)


# 함수가 뭔지 . 그리고 어떻게 사용하는지


# print(1)
# print(안녕?)

# print() 는 파이썬에서 제공하는 함수이다 .(내장 함수)

# 내가 만든함수
# def sayHi():
#     print(f"hi! python ,!!")

# sayHi()
