# 프로그래밍 언어

# 프로그래밍이란?

# 컴퓨터언어(바이너리)-> 논리의 흐림에 따른 작동
# 0,1,2,3,4,5,6,7,8,9진수 0:7진수 0:F 진수 9,A(10),B(11),C(12),D(13),E(14),F(15)
# 바이너리 <- 컴퓨터는 이걸 읽어 이걸 실행하는거야

# 코딩 (프로그래밍 언어 : Python, C ,Cpp , JAVA , JS , C#, Go, Rust, Ruby )

# 프로그래밍언어는 "도구" -> 중요하지않아 -> 뭘해야되나요?
# -> 개발자( 로직 을 만들고 더, 효율적으로 ,더 소비자에게 , 더 철학적으로 , 더 사고적으로 )
#    -> 코더( 필요가 없어 )

# 프로그래밍 언어 : 자세히 배워요 / 원리를 다 알려줄거야
#

# C / 이게 조상격
# Python ,JAVA , JS

# C / 이게 조상격
# 컴파일 / 번역기? C언어  ->  어셈블리어  -> 바이너리
# com< 어셈블리어 < C <  < Py < usr

# 어떤 펑션(기능) 사용 할 때 어떻게 작동하는지 알고 배우는 시간
