# 지민아 이거 보이지?
# 이걸로 피드백 줄게?
# 10 시 16분에 시작하자?
# 자 시작하자
# 자 이것도 비슷한 문제야
# 그렇지 내림차순 + cnt
# "공백" 자 지금처럼 하면
# 첫번째 공백이 몇번나오지? n번아니야?
# i 가 처음에 n이지
# 그럼 n번 공백 출력을 반복하겠지?
# 이해되니?
# i 가 아니라
# n - i 여야지?
# 일단 한번해봐 그럼
# 자 선생님이 말했지
# i 가 처음 떄 뭐야 ?
# 그치? 포문을돌릴때
# 첫번째인자만큼은 머리로 시뮬레이션을 돌려야해
# 오켕;? 담 문제 고

# range!!!!!아까 스펠링 틀렸었어
# 잘했어
# 문제 설명해봐 ㄱㄱㄱㄱㄱ

# 문제 잘못읽었어
# 문제 설명해봐 쌤한테
# 예제 살펴봐바
# 아 미안..ㅋㅋㅋㅋ미안미안 고고 잘읽었네
# 내가 잘못읽었어 미안하다
# 바로문제로 고고

# 자 이런문제는 우리 옛날에 풀었던 문제랑 비슷해
# 일단은 크게 잡고 가는거야
# 이문제는 몇 바이 몇 이야?
# 말해바
# 아니지 n이 주어졌을 때 몇바이몇이야?
# 기본 형인 nxn이야
# 그리고 조건으로 .. 제거 및 변형을 해가는거야
# 오케이?
# 우리 접떄 했던
# ************
#   *  *  *
#      *  *
#         *
# 이거 기억나?
# 이런문제 처럼
# 처음에는 그냥 nxn 행렬을
# 만들어 그리고 조건을 먹여서
# 변형시키면돼 알았지?
# 쉼표뒤에 공백
# 자이제 뭐해야돼? 조건먹여야지?
# 일단을 출력을하고 넘어가는것같은데
# 실행해봐 잘했어
# 오늘은 여기까지하자
# 고생했어 오늘 이해해줘서 고마워~
