

# if  A > B
# elif A < B
# else

# a,b,c
# 이게 몇 뭉탱이(논리 집합)인지?
# 1개의 집합 , 3가지 경우

# ____
# if age == 12
#    if sex == 'w':
#    else:
# elif age > 12
#    if sex == 'w':
#    else:
# else  ( age < 12 )
#    if sex == 'w':
#    else:
# ____

a, b = map(str, input().split())
b = int(b)

# str , int
# aAge, aSex


# 성별 ?  나이?
# if 남자니? :
#     if 성인이니?:
#     else:(어린이니)

# else (여자니?)
#     if 성인이니?
#     else (어린이니)
# ___________________________________________________________
# 조건문 ,,,
# a의 나이와 a의 성별(문자열)을 한 줄에 입력받고,

# a 가 성인 일 때
#      a 가 남자인 여자인지 궁금해
#      남자라면 M,여자라면 W 출력해
# 그렇지 않을 때
#      남자라면 MC
#      몸무게를 입력받고,
#        몸무게를 출력해줘
#      여자라면 WC
# ___________________________________________________________
# if a성인이니?
#     if 남자니?
#         print("M")
#     else:
#         print("W")
# else :
#     if 남자니?
#         print("MC")
#         aw = int(input())
#         print(aw)
#     else:
#         print("WC")

# 성인
#   남자
#   여자

# 성인아님
#   남자
#   여자

# 문제1 멕시코인지 아닌지 ? 남자인지 여자?

# 문제2 남자인지 여자인지 ? 고등학생인지 아닌지?

# 문제3 여자 중에서  20대 인지 30대인지 40대인지 ?

# 문제4 중학생 중에서 아이폰사용자인지 삼성사용자인지?

# 문제5
# 20대인지 30대인지 ?
# 대학생인지 아닌지 ?
# 군필인지 아닌지?

# 20대
#   대학생
#      군필인지?
#      군필아닌지?
#   대학생아님
#      군필인지?
#      군필아닌지?
# 30대
#   대학생
#      군필인지?
#      군필아닌지?
#   대학생아님
#      군필인지?
#      군필아닌지?
