# arg1, arg2 = 1, 2
# # type : INT ,STR , FLOAT , BOOL

# print(arg1, arg2, end="\n", sep=" ")  # 함수 / 옵션 : end , sep
# input()  # 함수 STR -> INT, FLOAT

# 형 변환 / 타입("나")

# 함수 ,메서드
# 달리다 : 함수
# 빠르게 : 메서드

# 함수  . 메서드

# 11 32 41


# ['11', '32', '41'] / 배 '열'  ? ? ? ?
# 문자 (배) 열
"1 2 3 2 4"
#    -12 -11                -5 -4 -3   -2    -1
#      0  1  2  3  4  5  6  7  8  9   10    11
# arr = [1, 1, 2, 123, 3.031]

# print('arr[-1] :', arr[-1])
# map? map 이 배열의 원소을 모두 변경하는 방법

# "11 32 41"
# "11" "32" "41"

# input().split()
arr = "11 32 41".split(" ")
print(arr)
a1, a2, a3 = map(int, arr)
# a1, a2, a3 = int(arr[0]), int(arr[1]), int(arr[2])
print(a1+a2+a3)

#      01234
# arr = '1 232 3 142'
# print((arr[0])+(arr[2:5]))
# print(int(arr[0])+int(arr[2:5]))

# two_time_num
# twoTimeNum
# 값:매개변수- > 함수 -> 값*2


# def two(eiwe):
#     print(eiwe)
#     return eiwe*2


# eiwe
# dwehuidf = 2
# two(dwehuidf)


# 입력받아서 5배한다음
# 그수가 0이 되기전 까지  출력해줘

# 함수는 반환 을 뭘하지? -> 반환이없어!!

# 16 번줄 뭘하는거야?

# 입력받아 ! -> 받은수를 -함수에 넣어 - > 함수 실행!

# 함수는 리턴이없어 그냥 작동하는 함수야
# 뭐만 필요해? 값 입력값만 필요해


# 당연히 달라도돼


# 문자열을 입력 받아서
# 문자열 가장 끝에 친구를 30개 붙여서
# 반환해주세요
# 그걸 출력해줘요


# 모든 것들 헷갈려요 ,,
# "초기화,타입" ....


# 숫자를 입력받아요 .

# 함수

# 자리수  1,10,100,1000의 자리수니?
# 1 작다~
# 10 작아
# 100 큰데?
# 1000 짱크

# 자리수를 반환해주세요

# 입력받은수랑 자리수랑 더한 값을 출력해주세
