# # # # w = " "

# # # # for day in range(1, 32, 1):
# # # #     if w == "r":
# # # #         print("우산 쓰고가!")
# # # #     elif w == "h":
# # # #         print("썬크림 발랐니?")
# # # #     elif w == "g":
# # # #         print("야 날씨 진짜 좋다.")
# # # #     elif w == "s":
# # # #         print("와 눈온다~")

# # # # # 2 16 30
# # # # for day in range(1, 31, 1):
# # # #     if day % 14 == 2:
# # # #         print(f"날짜1월 : {day}일 / 야호 노는날이다.")
# # # #     else:
# # # #         if day % 7 == 1:
# # # #             print(f"날짜1월 : {day}일 / 야호 코딩 수업하는날이다.^_^!")
# # # #         if day % 3 == 1:
# # # #             print(f"날짜1월 : {day}일 / 수학학원가다니..ㅠㅠ")
# # # #         if not (day % 7 == 1) and not (day % 3 == 1):
# # # #             print(f"날짜1월 : {day}일 / 아무것도안하는날~")

# # # # range(출발점 = 0, 종료지점, 접근폭 = +1)

# # # # range(0, 10, 1 ):
# # # # 0,1,2,3,4,5,6,7,8,9 -> 10개
# # # # range(10):


# # # # for i in range(7, 2, -1):  # range(7, 2,-1)
# # # #     print(i-2, end=" ")
# # # # 5 4 3 2 1


# # # # 기준을 잡고 ,,, 생각하자!
# # # # i = 0 j = 0
# # # # i = 0 j = 1
# # # # i = 0 j = 2
# # # # i = 0 j = 3
# # # # 0->1->2->3
# # # for i in range(51):  # 51번 반복해요
# # #     print(0, end=" ")
# # #     # 반복할때 i 를 활용할게욧 ! -> 활용
# # #     # 반복할때 i 를 활용하지않아 ! -> 단순반복

# # # days = 31
# # # for _ in range(5):  # 5번 반복해요
# # #     print(days, end=" ")  # -> 단순반복
# # # #   31 31 31 31 31

# # # for i in range(5, 0, -1):  # 5번 반복해요
# # #     print(i, end=" ")  # -> 활용
# # # #   5 4 3 2 1

# # # for j in range(3):  # 3 번 반복해요
# # #     print(j + 1, end=' ')   # -> 활용
# # # #     1 2 3

# # for i in range(0, 4, 2):

# #     for j in range(0, 4-i, 1):
# #         print(i+j, end=" ")

# #     print()


# # # 0 1 2 3
# # # 2 3

# # # (0,0)(0,1)(0,2)(0,3)
# # # (2,0)(2,1)

# # # i = 0
# # #    j = 0
# # #    j = 1
# # #    j = 2
# # #    j = 3
# # # i = 2
# # #    j = 0
# # #    j = 1


# # # (i,j)
# # # (0,0) (0,1) (0,2) (0,3)
# # # (1,0) (1,1) (1,2)
# # # (2,0) (2,1)
# # # (3,0)

# # # (0) (1) (2) (3)
# # # (1) (2) (3)
# # # (2) (3)
# # # (3)

# # # i = 0
# # #   j = 0
# # #   j = 1
# # #   j = 2
# # #   j = 3
# # # i = 1
# # #   j = 0
# # #   j = 1
# # #   j = 2
# # # i = 2
# # #   j = 0
# # #   j = 1
# # # i = 3
# # #   j = 0

# # # 3 13 23 33 43

# # # 0 1 2 3
# # # 0 1 2 3
# # # 0 1 2 3
# # # 0 1 2 3

# # # 0 0 0 0
# # # 1 1 1 1
# # # 2 2 2 2
# # # 3 3 3 3

# # # # * * * *
# # # # * * * *
# # # # * * * *
# # # # * * * *


# # # for i in range(1, 10, 1):
# # #     if i % 2 == 1:
# # #         print()


# # 반복문,,,

# # 왜 나눠서쓸까요..?  왜 방법이 두개일까? ->
# # 방법이 2개야..!
# # - for 문 : range(범위) -> 몇번 반복할지 혹은 어디서 부터 어디까지 할지 알때
# # - while 문 : 반복하는 횟수를 모를때 쓰는거야

# flag = True

# cnt = 0

# while flag:
#     if cnt == 2:
#         flag = False
#     print(0)

#     cnt += 1

# # 위와 같음..
# for i in range(3):
#     print(0)


# 반복문을 멈추는 방법이 필요해요 . loop
flag = True
cnt = 0

while flag:
    cnt += 1

    n = int(input("입력하시오: "))

    if n == 0:
        flag = False
        continue
    else:
        print("Hi i'm LOOP!!")

    print(f"반복횟수 {cnt}")

#
# 입력하시오: 0
# 반복횟수 6
# break : 깨다.반복문을 깨부셔요

# continue : 조건을 확인하러가요 아래를 내려가지않고 1턴(반복의) 날려버려~
