
# # 자료형 type

# 50  # int
# 50.0  # float
# "50"  # str
# 50 + 50  # int
# 50.0 + 50.0  # float

# "50.0" + "50.0"  # str 2개

# "50.0 + 50.0"  # str 1개
# # "문자열 시작합니다
# # "문자열 끝납니다.

# # str
# # str = str + str
# # 문자열 string 문자들의 줄처럼 나열 되어있다.
# # "abcdef" <= "abc"+"def"
# # "123456" <= "123"+"456"


# # 문자열 = 문자열 + 문자열 + 문자열...
# # "5050" = "5" + "0" + "5" + "0"
# # "5050" = "50" + "50"
# "43"+"abc"
# 300 + "이서호"


# # 문자열 135 와 문자열 25 랑 더해줘


# # 정수 987654321 를 987654321 와 곱해줘
# # 저장.!

seoho = 987654321*987654321

print(seoho)
