# # 변수라 는 것을 만들었어요
# # 왜?  편하려고

# lsh = 3123412412532513453412341242141241  # 초기화 initialize
# lsj = 3123412
# car = 32
# bus = 32.6876
# tree = "123"
# tree = 123

# # int, float, str
# # + ,- , *, /, //, %
# # /, //, %  ~~ 나누다

# # / (진짜 나누기)
# # 7÷4   |  7/4 == 1*4 + 3
# # 16÷8  | 16/8 == 2*8 + 0
# # 75 ÷ 4 |75/4 ==18*4 + 3

# # 34124 % 10 | 34124/10 ==  3412*10 + 4
# # 727 % 10   |   727/10 ==  72*10   + 7
# # 1269 % 10   |   1269/10 == 126*10 + 9

# # /(진짜 나누기)
# print(75 / 4)
# # //(몫 나누기)
# print(75 // 4)
# # % (나머지 나누기)
# print(75 % 4)
# # int, str, int, str, int
# # int, str, str(int), str, int

# 3...C
a = 3
b = 'C'
# '...' str

print(a, b, sep='...')
print(a, '...', b, sep="")
