# type 자료형
# 숫자 : int (정수, 딱 떨어지는 수, . 없는 수)
1, 2, 50, 111, -2
# 숫자 : float (실수, . 이 있는 수 )
0.048267826, -1.1
# 문자 : str ("문자열 시작 "문자열 끝 , 문자열 = 문자열 + 문자열 )
print("\"")

# "+" : 글자 그 자체
#  +  : 더해주세요
print("3"+"3")  # => 33
print("3+3")   # => 3+3

# 변수 : 그릇
# 1 = sh / 달라요!
# = 초기화 set
sh = 115980632856871456320986508132567816570618725476234586123875678236587632789567836512387952
# 변수명(위치)  =  값 , 데이터 영역
print("sh: ", sh)
print("sh + sh: ", sh + sh)
print("sh * sh: ", sh * sh)

# sh를 sh+sh 로 초기화
sh = 30

sh = sh+sh
