# 변수,, 그릇  데이터를 저장해줘요 그리고 이름 불러요
# 변수 를 만들기위해서 초기화(setting) 해야해요
# 초기화를 어떻게하는 건가요? 초기화 기호 ,,  =  같다 아닌가요? 초기화라는 뜻.
# (변수의 이름 ) = (변수의 값) (O)
# (변수의 값) = (변수의 이름 ) (X)

# 수학 , = : 같다.
# 3 = 2+1
# 2+1 = 3

# 코딩 , = : 초기화
# name = 2331

a = 3  # a = 3, b = None <- error
b = 13  # a = 3, b = 13

b = a  # a = 3, b = 3 ,c = None
# b 를 a로 초기화
# a = 3, b = 3 ,c = None
c = a+b  # a = 3, b = 3 ,c = 6
# c 를 a+b 로 초기화


# print 출력 . 소스코드 ->터미널로 .
#  출력하는 동작 : function기능 (함수)
# print 라는 함수 , function
# 눌러야해. function 을 실행 시키는 방법
# 실행 버튼 누르기: ()
print()
# 내용물을 어떻게 적지?
# 버튼안에다 넣어요

a = 948162985  # 초기화

# type : 자료형
# 숫자 (int, float)
# 문자 (str) " ", ''

print(a)   # 변수 a
print('a')  # 문자 a
