# Type (=자료형) , WHAT? ,WHY?
# - 숫자 int 정수
# - 숫자 float 실수
# - 문자 str 문자열 (문자열 = 문자열 + 문자열)

# __________________________
# 99999999999999999999999999
# 999999999.9999999999999999

# 변수 : 변수명 (서호의 마음대로~)

one = 19
# 초기화 (= set)
# 현실 = : 같다라는 뜻 / 컴퓨터 = : set!
# 현실 같은 이름의 변수 여러명 가능
# 컴퓨터 같은 이름의 변수 하나만!
# 파이썬에서는 위에서 아래로 내려가면서 인식해요 (컴퓨터가)
# -1 = one

# 변수명 | (초기화 =) | data(=value)

# 그릇(+이름) | 에 담을게(저장)~ | 내용물

철수 = 17  # set
철수 = 16  # reset
서호 = 11

# 철수는 16
# 서호는 11

서호 = 서호 + 1
# 서호는 12

# a 를 4 로 초기화 하시오.
# d 를 -4 로 초기화 하시오.
# c 를 11 로 초기화 하시오.
# b 를 a+d 로 초기화 하시오.

a = 4
d = -4
c = 11
b = a+d

# function 터미널로 데이터를 출력하는 기능(함수)!
# function_name

# "\n" ewline
print(b, end="이서호")
print(a, end="이서호")

# print(d)
# print(a, b, c, d, sep='')
########################################
# sh 라는 변수를 19 로 초기화 한 후
# sh 곱하기 sh 를 한 뒤 sh 에 저장해줘(sh에 초기화 해줘)
# 그리고 sh 를 두 번 출력해줘 (줄바꿈은 하지말아줘)
########################################
