# 변수
# 값을 재활용하기위해서 넣어두는 박스인데 거기에 이름붙인거야

# |__10__|
# 변수명 지어보기
# 시험점수 : score
# 나이 :age
# 정수 : num , iNum , i_num , n
# 실수 : num , fNum , f_num , n
# 뭔가를 셀 때 (카운트 한다.) : count , cnt
# 임시적 것 : tmp
# 임시적인것 아무의미가 없을 때 : i ,j ,k
# 상태나 여부를 알릴 때 : flag , state
#
# print(인자 1,인자 2 .. , end, sep)
# input() : str ,숫자로 쓰려면 형변환해줘야해
# map(int, input().split(" ")) 한 줄에 여러 값을 입력받을 때
# input() 여러번쓴다 . 여러 줄에 여러 값을 입력받을 때

# 사칙연산

# +,-,*
# / 진짜 나누기
# // 나누기 -> 몫 만보여줘
# %  나누기 -> 나머지 만보여줘


# 형식 지정자
# format 실수 float
sum1 = 15
avr1 = 3.5
print("%x" % sum1, "%.2f" % avr1)

# 0123456789 -> 10 진법 decimal

# 01 -> 2 진법

# 01234567 -> 8 진법

# 0123456789ABCDEF -> 16 진법


# avr = 3.1231
# avr = int(avr)
# print("%.0f" % avr)
# a = int(input())

# 변수명 = 값
# a  =  2
# b  =  a값 + 3값
# 이름로 해석을 =


# 이서준의 키 (변수명)= 이서준의 키(값) +3
# 이서준의 키 (변수명)= 180(값) +3

# print(샘의 나이) 26
# 쌤의 나이 = 26(값) + 1
# print(샘의 나이) 27
