
# # a = int(input())
# # b = int(input())
# # c = a*(b % 10)     # b%10  1의 자리수
# # d = a*((b % 100)//10)  # 473:  473%100 -> 73//10 -> 7 :  10의 자리수
# # e = a*((b % 1000)//100)  # 473%1000 -> 473//100 -> 4 : 100의 자리수
# # f = c + d * 10 + e*100
# # 2360
# # 37760
# # 141600

# # if :(flow control) : 제어하다, 조정하다

# # |\_/|
# # |q p| /}
# # ( 0 )"""\
# # |"^"` |
# # ||_/=\\__|

# # print("|\_/|")
# # print("|q p|")
# # print("(0)\"\"\"\\")
# # print("|"^"`    |")
# # print("||_/=\\__|")

# # print("""
# # |\_/|
# # |q p| /}
# # ( 0 )\"\"\"\
# # |"^"` |
# # ||_/=\\__|
# #       """)

# # print('''|\_/|
# # |q p| /}
# # ( 0 )"""\
# # |"^"` |
# # ||_/=\\__|''')


# # H, M = map(int, input().split())
# # if M >= 45:
# #     M = M-45
# # else:
# #     if H == 0:
# #         H = H-1 + 24
# #         M = M-45 + 60
# #     else:
# #         H = H-1
# #         M = M-45 + 60

# # H,M=map(int,input().split())
# # M=M-45
# # if M<45:
# #     M+= 60
# #     H-= 1
# #     if H == 0:
# #         H+= 24


# # 0 47
# # 0 2

# # 0 44
# # 23 59

# # 7 20
# # 6 20-45 + 60 : 35

# # 10 44
# # 9 59 => M-45 + 60

# # M 45이상


# a = 97  # int
# b = 13  # int
# print(int, str, int, str, int)
# print(a, '-', b, '=', a-b)
# print(f'{a} - {b} = {a-b}')

print(1)  # 인자 1게
print(1, 1)  # 인자 2개
print(1, 1, 1)  # 인자 3개
# 정수 문자열 한 줄에 출력.
print(1, "a", 2, "5")
