# # 초기화  =
# # 변수의 값을 설정하려고.
# # | 주소  | = | 값  |
# # str, int ,float
# # print(,end="\n",sep =" ")
# # input() 터미널 -> 소스코드 값을요. 어떤? : str
# # input().split(" ")
# # "2 3 5".split(" ")
# a, b, c = "2", "3", "5"
# # map ?
# # a=int(a)
# # b=int(b)
# # c=int(c)
# # a, b, c = map(int, ["2", "3", "5"])
# # print(type(a), type(b), type(c))
# # a, b, c = map(int, input().split(" "))
# # +  -  / * // % **

# # 7 ÷ 4 = 1*4 + 3
# # 7 // 4 = 1
# # 7 % 4 = 3

# # 자리수의 값
# # 654
# # 1의 자리수  654 % 10 = 4
# # 10의 자리수 (654 % 100 ) // 10 = 5
# # 100의 자리수 (3654 % 1000 ) // 100 = 6

# # 10000의 자리수 (312543654 % 100000) //10000  =

# # res_10 = ((int(input())) % 100000)//10000
# # print(res_10)
# # 312543654
# #     43654


# # a = '0097'
# # print(a)
# # a = int(a)
# # print(a)

# # '3124is313'


# # arr = [1, 2, 3, 43, 51, 54]
# # print(sum(arr)/len(arr))


# # if 는 조건문 / 흐름제어

a = 1
# a = 2
# a = 3
# a = 4
# while 1:
#     a += 1
#     if a > 10:
#         break
#     if a > 3:
#         print("3초과 입니다")
#     if a % 2 == 0:
#         print("짝수 입니다.")
#     else:
#         print("홀수 입니다.")
