# word = "131"  # word 의 타입은 ? / 한글로도 가능
# word = "131"  # word 는 뭐지? :
# iNum = 2     # iNum 의 타입은 ?  /한글로도 가능
# iNum = 2     # iNum 은 뭐지? :
# word + word  # 은 가능한가? (O/X)
# word + iNum  # 은 가능한가? (O/X)

# iNum = 13    # 에서 변수명은 ? :
# iNum = 13    # 해당과정을 뭐라고하나? :

# = 을 기준으로 왼쪽을 ? :
# = 을 기준으로 오른쪽을 ? :

# 문자열에서 특수명령을 내리기위해 사용하는 기호는?
# 문자열에서 줄바꿈을 하기위한 명령어는?
# 문자열에서 " 을 출력하기위한 명령어는 ?

# 변수란?  의  예시
# 초기화란?  의 예시
# 정수 int ? 의 예시
# 실수 float ? 의 예시
# 문자열 str ? 의 예시
# 위의 3가지 타입을 각각 초기화해보는 것

# sep 의 디폴튼?
# split() 의 디폴튼?
# end 의 디폴트는 ?
# ---------------------------------------------------------

# if 문
# 어려워서 -> 만약 뭐가 일어나면 어떤걸해줘~
# 범주화 : 카테고라이징

#  if - else - elif

# if - elif
# 하나의 세트입니다 .
# 조건을 달 수 있어요

# if 는 반드시와야해
# elif 와도 되고 안아와도돼

# if - else
#
# 하나의 세트입니다 .
#
# if 는 반드시와야해
# else 와도 되고 안아와도돼
# if는 조건을 달수 있고 else 조건 달수 없다.

# and  (하면서,연속해서 ,,,)
# 키거 and 잘생
a = 0
if (a > -1 and a < 1):
    print(True)
else:
    print(False)


# or (이거나)
l = 2
if l == 4 or l == 7 or l == 14:
    print("Good!")
else:
    print("Boo!")


# a = 0 ;
# if (1<a)


# 파이썬언어는
# 코드를 쓰면 컴퓨터의 소프트웨어가 interpreter
# 다른언어는 comliper
