# if 조건/분기문
# 조건이 참이라면 들여쓰기된 코드를 실행해.
# 여러개의 조건문이 있을 때 헷갈려해
# ------------
# if 참 -> O
# elif 참 -> X
# ------------
# if 참 -> O
# if 참 -> O
# ------------
# and : 하면서, 이면서 O--O
# or : 하거나, 이거나 |O O|
#
# 문제1.
# 정수를 하나 입력받고
# 그 수가 짝수라면 1 홀수라면 0을 출력하세요

# 문제2.
# 문자 하나와 정수하나를 한 줄에 입력받고
# 그 문자가 모음 (a,e,i,u,o) 이고 정수가 짝수라면 A
# 그 문자가 모음 이고 정수가 홀수라면 B
# 그 문자가 모음이아니고 정수가 짝수라면 C
# 그 문자가 모음이아니고 정수가 홀수라면 D

# 문제3.
# 한 줄에 정수 두 개와 문자 하나를 입력받고
# 문자 가 "a","b","c" 중 하나라면
# 두정수의 합의 1의자리수를 출력

# 문자 가 "d","e" 중 하나라면
# 두정수의 곱의 1의자리수를 출력

# 위의 문자가 모두 아닌 경우
# 두정수의 합과 곱의 합 의 10의 자리수를


# 너 3배수니 짝홀이니 ?

# if a%3 ==0 and a%2==0:
# if a%3 ==0 and a%2==1:
# if a%3 !=0 and a%2==0:
# if a%3 !=0 and a%2==1:

# if a%3 ==0:
#     if a%2==0:
#     else:
# else:
#     if a%2==0:
#     else:


# 1의자리수
# 2136%10 9~0
# 6

# 10의자리수
# 2136//10
# 213%10 9~0

# 10의자리수
# 2136//100
# 21 % 10
# (x //10)%10


# 한줄 에 하나씩 정수를 2개 입력받고,
# 이 두수의 합과 평균의 구하고

# 이 두개의 값의 10의자리수와 1의자리수 같다면
# 두 수를 합과 평균을 공백을 간격으로 출력하고

# 이 두개의 값의 10의자리수와 1의자리수 같지 않다면
# 두 수의 합의 10의자리수와 평균의 1의자리수를 공백을 간격으로 출력
